xtee55/mediator-common-test/src/main/resources/xroad-simple3.request

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header xmlns:xrd="http://x-road.ee/xsd/x-road.xsd">
        <xrd:consumer>consumer</xrd:consumer>
        <xrd:producer>producer</xrd:producer>
        <xrd:userId>EE37702211234</xrd:userId>
        <xrd:service>producer.testQuery.v1</xrd:service>
        <xrd:id>1234567890</xrd:id>
        <xrd:unit>unit</xrd:unit>        
        <xrd:position>position</xrd:position>
        <xrd:userName>userName</xrd:userName>
        <xrd:async>true</xrd:async>
        <xrd:paid>paid</xrd:paid>
        <xrd:issue>issue</xrd:issue>
        <xrd:encrypt>encrypt</xrd:encrypt>
        <xrd:encrypted>encrypted</xrd:encrypted>
        <xrd:foobar>baz</xrd:foobar>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:testQuery xmlns:ns1="http://cosumer.ee.xroad.net">
            <request>
                <name>foo</name>
                <age>35</age>
            </request>
        </ns1:testQuery>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
